Revit 2026 API

# MullionJoinMullion Method

---

This method is used to control the join condition the current Mullion with its neighboring mullions.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void JoinMullion()
```
```vb
Public Sub JoinMullion
```
```cpp
public:
void JoinMullion()
```
```fsharp
member JoinMullion : unit -> unit
```

The mullions being perpendicular to it will be broken accordingly.

#### Reference

Mullion Class

Autodesk.Revit.DB Namespace